ChibiOS/ChibiOS-Contrib/os/hal/ports/NUMICRO/NUC126/nuc126_registry.h
/*
    Copyright (C) 2019 /u/KeepItUnder

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    NUC126/nuc126_registry.h
 * @brief   NUC126 capabilities registry.
 *
 * @addtogroup HAL
 * @{
 */

#ifndef NUC126_REGISTRY_H
#define NUC126_REGISTRY_H

/*===========================================================================*/
/* Platform capabilities.                                                    */
/*===========================================================================*/

/**
 * @name    NUC126 capabilities
 * @{
 */

/* RCC attributes. */
#define NUC126_HAS_HSI48                     TRUE
#define NUC126_HAS_HSI_PREDIV                FALSE
#define NUC126_HAS_MCO_PREDIV                TRUE

/* ADC attributes.*/
#define NUC126_HAS_ADC1                      TRUE
#define NUC126_ADC_SUPPORTS_PRESCALER        FALSE
#define NUC126_ADC_SUPPORTS_OVERSAMPLING     FALSE
#define NUC126_ADC1_IRQ_SHARED_WITH_EXTI     FALSE
// TODO Double check this, but it didn't change from NUC123
#define NUC126_ADC1_HANDLER                  Vector70
#define NUC126_ADC1_NUMBER                   Vector70_IRQn
#define NUC126_ADC1_DMA_MSK                  (NUC126_DMA_STREAM_ID_MSK(1, 1) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 2))
#define NUC126_ADC1_DMA_CHN                  0x00000011

#define NUC126_HAS_ADC2                      FALSE
#define NUC126_HAS_ADC3                      FALSE
#define NUC126_HAS_ADC4                      FALSE

/* CAN attributes.*/
#define NUC126_HAS_CAN1                      FALSE
#define NUC126_HAS_CAN2                      FALSE
#define NUC126_HAS_CAN3                      FALSE

/* DAC attributes.*/
#define NUC126_HAS_DAC1_CH1                  FALSE
#define NUC126_HAS_DAC1_CH2                  FALSE
#define NUC126_HAS_DAC2_CH1                  FALSE
#define NUC126_HAS_DAC2_CH2                  FALSE

/* DMA attributes.*/
#define NUC126_ADVANCED_DMA                  FALSE
#define NUC126_DMA_SUPPORTS_CSELR            FALSE
#define NUC126_DMA1_NUM_CHANNELS             5
#define NUC126_DMA2_NUM_CHANNELS             0
// TODO Double check this, but it didn't change from NUC123
#define NUC126_DMA1_CH1_HANDLER              Vector64
#define NUC126_DMA1_CH23_HANDLER             Vector68
#define NUC126_DMA1_CH4567_HANDLER           Vector6C
#define NUC126_DMA1_CH1_NUMBER               Vector64_IRQn
#define NUC126_DMA1_CH23_NUMBER              Vector68_IRQn
#define NUC126_DMA1_CH4567_NUMBER            Vector6C_IRQn

#define NUC126_DMA1_CH2_NUMBER               NUC126_DMA1_CH23_NUMBER
#define NUC126_DMA1_CH3_NUMBER               NUC126_DMA1_CH23_NUMBER
#define DMA1_CH2_CMASK                      0x00000006U
#define DMA1_CH3_CMASK                      0x00000006U

#define NUC126_DMA1_CH4_NUMBER               NUC126_DMA1_CH4567_NUMBER
#define NUC126_DMA1_CH5_NUMBER               NUC126_DMA1_CH4567_NUMBER
#define NUC126_DMA1_CH6_NUMBER               NUC126_DMA1_CH4567_NUMBER
#define NUC126_DMA1_CH7_NUMBER               NUC126_DMA1_CH4567_NUMBER
#define DMA1_CH4_CMASK                      0x00000078U
#define DMA1_CH5_CMASK                      0x00000078U
#define DMA1_CH6_CMASK                      0x00000078U
#define DMA1_CH7_CMASK                      0x00000078U

/* ETH attributes.*/
#define NUC126_HAS_ETH                       FALSE

/* EXTI attributes.*/
/* #define NUC126_EXTI_NUM_LINES                20 */
/* #define NUC126_EXTI_IMR_MASK                 0xFFF50000U */

/* GPIO attributes.*/
#define NUC126_HAS_GPIOA                     TRUE
#define NUC126_HAS_GPIOB                     TRUE
#define NUC126_HAS_GPIOC                     TRUE
#define NUC126_HAS_GPIOD                     TRUE
#define NUC126_HAS_GPIOE                     TRUE
#define NUC126_HAS_GPIOF                     TRUE
#define NUC126_HAS_GPIOG                     FALSE
#define NUC126_HAS_GPIOH                     FALSE
#define NUC126_HAS_GPIOI                     FALSE
#define NUC126_HAS_GPIOJ                     FALSE
#define NUC126_HAS_GPIOK                     FALSE

/* I2C attributes.*/
#define NUC126_HAS_I2C0                      TRUE
#define NUC126_HAS_I2C1                      TRUE

/* QUADSPI attributes.*/
#define NUC126_HAS_QUADSPI1                  FALSE

/* RTC attributes.*/
#define NUC126_HAS_RTC                       TRUE
#define NUC126_RTC_HAS_SUBSECONDS            FALSE
#define NUC126_RTC_HAS_PERIODIC_WAKEUPS      FALSE
#define NUC126_RTC_NUM_ALARMS                1
#define NUC126_RTC_HAS_INTERRUPTS            TRUE

/* SDIO attributes.*/
#define NUC126_HAS_SDIO                      FALSE

/* SPI attributes.*/
#define NUC126_HAS_SPI1                      TRUE
#define NUC126_SPI1_SUPPORTS_I2S             TRUE
#define NUC126_SPI1_RX_DMA_MSK               NUC126_DMA_STREAM_ID_MSK(1, 2)
#define NUC126_SPI1_RX_DMA_CHN               0x00000030
#define NUC126_SPI1_TX_DMA_MSK               NUC126_DMA_STREAM_ID_MSK(1, 3)
#define NUC126_SPI1_TX_DMA_CHN               0x00000300

#define NUC126_HAS_SPI2                      TRUE
#define NUC126_SPI2_SUPPORTS_I2S             TRUE
#define NUC126_SPI2_RX_DMA_MSK               NUC126_DMA_STREAM_ID_MSK(1, 4)
#define NUC126_SPI2_RX_DMA_CHN               0x00003000
#define NUC126_SPI2_TX_DMA_MSK               NUC126_DMA_STREAM_ID_MSK(1, 5)
#define NUC126_SPI2_TX_DMA_CHN               0x00030000

#define NUC126_HAS_SPI3                      FALSE
#define NUC126_HAS_SPI4                      FALSE
#define NUC126_HAS_SPI5                      FALSE
#define NUC126_HAS_SPI6                      FALSE

/* TIM attributes.*/
#define NUC126_TIM_MAX_CHANNELS              4

#define NUC126_HAS_TIM1                      TRUE
#define NUC126_TIM1_IS_32BITS                TRUE
#define NUC126_TIM1_CHANNELS                 1

#define NUC126_HAS_TIM2                      TRUE
#define NUC126_TIM2_IS_32BITS                TRUE
#define NUC126_TIM2_CHANNELS                 1

#define NUC126_HAS_TIM3                      TRUE
#define NUC126_TIM3_IS_32BITS                TRUE
#define NUC126_TIM3_CHANNELS                 1

#define NUC126_HAS_TIM4                      TRUE
#define NUC126_TIM4_IS_32BITS                TRUE
#define NUC126_TIM4_CHANNELS                 1

#define NUC126_HAS_TIM5                      FALSE
#define NUC126_HAS_TIM6                      FALSE
#define NUC126_HAS_TIM7                      FALSE
#define NUC126_HAS_TIM8                      FALSE
#define NUC126_HAS_TIM9                      FALSE
#define NUC126_HAS_TIM10                     FALSE
#define NUC126_HAS_TIM11                     FALSE
#define NUC126_HAS_TIM12                     FALSE
#define NUC126_HAS_TIM13                     FALSE
#define NUC126_HAS_TIM14                     FALSE
#define NUC126_HAS_TIM15                     FALSE
#define NUC126_HAS_TIM16                     FALSE
#define NUC126_HAS_TIM17                     FALSE
#define NUC126_HAS_TIM18                     FALSE
#define NUC126_HAS_TIM19                     FALSE
#define NUC126_HAS_TIM20                     FALSE
#define NUC126_HAS_TIM21                     FALSE
#define NUC126_HAS_TIM22                     FALSE

/* USART attributes.*/
/* #define NUC126_HAS_USART1                    TRUE
#define NUC126_USART1_RX_DMA_MSK             (NUC126_DMA_STREAM_ID_MSK(1, 1) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 3) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 5))
#define NUC126_USART1_RX_DMA_CHN             0x00080808
#define NUC126_USART1_TX_DMA_MSK             (NUC126_DMA_STREAM_ID_MSK(1, 2) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 4))
#define NUC126_USART1_TX_DMA_CHN             0x00008080

#define NUC126_HAS_USART2                    TRUE
#define NUC126_USART2_RX_DMA_MSK             (NUC126_DMA_STREAM_ID_MSK(1, 1) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 3) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 5))
#define NUC126_USART2_RX_DMA_CHN             0x00090909
#define NUC126_USART2_TX_DMA_MSK             (NUC126_DMA_STREAM_ID_MSK(1, 2) |\
                                             NUC126_DMA_STREAM_ID_MSK(1, 4))
#define NUC126_USART2_TX_DMA_CHN             0x00009090 */

#define NUC126_HAS_USART1                    FALSE
#define NUC126_HAS_USART2                    FALSE
#define NUC126_HAS_USART3                    FALSE
#define NUC126_HAS_UART4                     FALSE
#define NUC126_HAS_UART5                     FALSE
#define NUC126_HAS_USART6                    FALSE
#define NUC126_HAS_UART7                     FALSE
#define NUC126_HAS_UART8                     FALSE
#define NUC126_HAS_LPUART1                   FALSE

/* USB attributes.*/
#define NUC126_HAS_USB                       TRUE
#define NUC126_HAS_OTG1                      FALSE
#define NUC126_HAS_OTG2                      FALSE

/* IWDG attributes.*/
#define NUC126_HAS_IWDG                      TRUE
#define NUC126_IWDG_IS_WINDOWED              TRUE

/* LTDC attributes.*/
#define NUC126_HAS_LTDC                      FALSE

/* DMA2D attributes.*/
#define NUC126_HAS_DMA2D                     FALSE

/* FSMC attributes.*/
#define NUC126_HAS_FSMC                      FALSE

/* CRC attributes.*/
#define NUC126_HAS_CRC                       TRUE
#define NUC126_CRC_PROGRAMMABLE              TRUE

/** @} */

#endif /* NUC126_REGISTRY_H */

/** @} */

